<template>
    <div class="background" id="gods">
        <container>
            <main-page-link/>
    
            <div class="title">
                <h1>Боги Иррилиума</h1>
                <div class="line"></div>
            </div>
    
            <div class="tabs flex-row">
                <template v-for="(god, index) in godTabs" :key="index">
                    <button :class="{active: god.id == activeTabId}" @click="switchActiveTabId(god.id)">{{ god.name }}</button>
                </template>
                
            </div>
            <div class="tabs-content">
                <div v-if="activeTabId == 0">
                    <p>Тут будет общая сводка или вроде того</p>
                </div>
                <div v-if="activeTabId == 1">
                    <div class="flex-row">
                        <img class="god-portrait" src="../static/gods_1.gif" alt="" />
                        <div>
                            <p>- Бог добродетели, жизни, очищения, и защиты. Самый благочестивый из всех богов, его принципы призывают к тому, чтобы поддерживать мир, там, где это возможно, а крайние меры применять лишь против истинно злых существ, и тех, кто этого заслуживает. Более того, Седдар самый милосердный из всех божеств, и в основном его жрецы, применяют самые гуманные меры в борьбе с беззаконием и злом - силой убеждения и собственной верой, призывая грешников сойти с пути порока и зла.</p>
                            <p>Вследствие этого, вера в Седдара очень распространена, и является последней надеждой беспомощных и «заблудших». Только добро, только правда, только светлые побуждения, и мудрость, которая не позволит ошибиться, и не сойти с благочестивого пути – всё это, относится к Седдару – заботливому отцу всего живого, самому милосердному судье, хранителю добра.</p>
                            <p>Жрецам этого бога бывает очень нелегко нести ответственность за поддержание столь нелёгкого этоса и убеждений. Многие из них сталкиваются с огромным количеством дилемм в процессе своего служения, и лишь мудрейшие справляются с их решением, тем самым, укрепляя свою веру, от которой зависит близость к богу, и к его божественной силе.</p>
            
                            <h3 style="color: #8DB3E2;">Символика бога:</h3>
                            <p>Знаком Седдара, является серебряный крест, который символизирует главные аспекты веры. Его образ означает одновременно как запрет от нечистых сил, так и преграду защищающую беспомощных. Более того, крест так же ассоциируют с лучами света, который дарует жизнь и очищает от тьмы. Серебро также считается символом чистоты, поэтому нередко идёт в обиход духовенства Седдара.</p>
                            <p>Иногда символику бога изображает белая человеческая длань (длань Седдара), и символизирует исцеление.</p>
                        </div>
                    </div>
    
                    <h3 style="color: #8DB3E2;">Преимущественные отношения жрецов Седдара к жрецам других богов:</h3>
                    <ul>
                        <li>Раддес Вечная вражда (Главный враг)</li>
                        <li>Танатос  Вечная вражда</li>
                        <li>Анарион Нерушимый союз</li>
                        <li>Мортис Союз</li>
                        <li>Тогел-Ра Компромисс</li>
                        <li>Ксан Компромисс</li>
                    </ul>
                    <p>Главными оппонентами жрецов Седдара, в основном выступают жрецы Раддеса, принципы которых являются полной противоположностью его принципам и веры. Что касательно Танатоса, то здесь дела обстоят примерно также, хотя жрецы Танатоса не столь сильно извращены в своём влиянии на людей, и зачастую просто стараются их убить, тогда, как жрецы Раддеса предпочитают пытку смерти. Это конечно не повод, однако у Танатоса и без того немало врагов, а против служителей Раддеса, самым эффективным оружием является сила Седдара.</p>
                    <p>Самые хорошие отношения жрецы Седдара имеют со жрецами Анариона, хотя изредка расходятся во мнениях. Почти также дела обстоят с отстраненными и специфичными жрецами богини Мортис, но в основном отношения завязываются благодаря общему врагу.</p>
                    <p>С друидами Тогел-Ра, жрецы Седдара тоже зачастую находят общий язык, но не всегда, из-за непреклонного нейтралитета служителей природы, которые считают войны и смерть – неизбежным порядком вещей. Более того, иногда друиды утверждают, что это противоборство создано самим Тогел-Ра (которого считают создателем всего) чтобы служить природе, и контролировать баланс жизни. Поэтому союз с друидами в основном возможен, только если жрецам Седдара удастся убедить друидов, что их проблема может глобально, и пагубно повлиять на природу (в том или ином месте).</p>
                    <p>Со жрецами Ксана, жрецы Седдара пытаются вести себя осторожно, но желают держать их поближе к себе, чтобы в нужный момент, неукротимое оружие служителей бога войны, было на их стороне. Более того, они часто не оставляют попыток по максимуму усмирить или сдержать их разрушающую ярость, и ни в коем случае не допустить того, чтобы оппозиционная вера захватила над ними власть.</p>
    
                    <h3 style="color: #8DB3E2;">Краткое описание сфер сил Седдара:</h3>
                    
                    <h4>Благодать (Специалист сферы – Благодетель)</h4>
                    <div class="flex-row ability">
                        <img src="../static/gods_1_1.jpg" alt="" />
                        <p> - Основная сфера жрецов Седдара. Она включает в себя заклинания, эффект которых состоит в благоприятном влиянии на живых существ, созидании благотворной энергии способной создавать божественный свет, и источники позитивной жизненной силы. Главная особенность сферы заключается во влиянии на чувства и эмоции живых существ, подкрепляя их, и изгоняя пороки и злобу.</p>
                    </div>
    
                    <h4>Жизнь (Специалист сферы – Целитель)</h4>
                    <div class="flex-row ability">
                        <img src="../static/gods_1_2.jpg" alt="" />
                        <p>- Это сфера Жизни, которая создаёт источники позитивной жизненной силы, связанные с восстановлением и исцелением живых существ. Эта энергия оказывает пагубное влияние для существ противоположной ей природы, существующих благодаря негативной энергии, или являющие собой проявление скверны и нечистых сил.</p>
                    </div>
    
                    <h4>Экзорцизм (Специалист сферы – Избавитель)</h4>
                    <div class="flex-row ability">
                        <img src="../static/gods_1_3.jpg" alt="" />
                        <p> - Это сфера очищения и изгнания. Она способна снимать и развеивать эффекты пагубного характера, воссозданные противоположной благодати энергии. Основной её особенностью является способность изгонять демонов на их родной план существования, или нанесения им урона, путем вычищения энергии их естества (что также влияет и на нежить).</p>
                    </div>
    
                    <h4>Покровительство (Специалист сферы – Заступник)</h4>
                    <div class="flex-row ability">
                        <img src="../static/gods_1_4.jpg" alt="" />
                        <p>- Это сфера защиты и надзора. С её помощью жрец может использовать заклинания, защищающие как от естественных, так и от неестественных сил и признаков. Силы этой сферы поддерживаются благодаря непосредственному божественному влиянию и его ангелов. На более высоких стадиях, силы этой сферы могут призывать дух ангела к жрецу, для соответственной помощи.</p>
                    </div>
    
                </div>
                <div v-if="activeTabId == 2">
                    <p>- Бог солнца, хранитель света и священного огня. Анарион нарекает своих служителей, быть более прямыми, никогда не лгать (даже во имя благого дела), и рьяно отстаивать устои добра. Во многом принципы Анариона схожи с принципами Седдара, однако он предпочитает действовать более жёстко в отношении непримиримых врагов отстаивающих порядок оппозиционной веры. Более того, в отношении всех остальных, жрецы Анариона ведут себя не столь сдержанно и терпимо как жрецы Седдара, но их этос не обделяет жрецов милосердием.</p>
                    <p>Считается, что Анарион – это сын Седдара, на самом же деле, бог солнца является одним из высших богов, силы которого хоть и схожи с силами Седдара, но имеют немало разительно-отличающихся принципов. Анарион очень лояльно относится к Седдару, и предпочитает поддерживать его идеологию, но (как и говорилось выше) иногда немного отклоняется от методов своего союзника, но никогда это отклонение не переходит за черту их хороших отношений.</p>
    
                </div>
            </div>
            <footer></footer>
        </container>
    </div>
</template>

<script>

import { defineComponent } from 'vue'; 
import MainPageLink from '../components/MainPageLink.vue';

export default defineComponent({
    name: 'GodsView',
    data() {
        return {
            activeTabId: 0,
            godTabs: [
                { name: "Общая информация", id: '0' },
                { name: "Седдар", id: '1' },
                { name: "Анарион", id: '2' },
                { name: "Тогел-Ра", id: '3' },
                { name: "Мортис", id: '4' },
                { name: "Ксан", id: '5' },
                { name: "Танатос", id: '6' },
                { name: "Раддес", id: '7' },
                { name: "Забытые и младшие боги", id: '8' },
            ]
        }
    },
    methods: {
        switchActiveTabId(newId) {
            this.activeTabId = newId;
        }
    },
    components: {
        MainPageLink
    },
});

</script>

<style scoped lang="scss">
#gods {
    background-image: url("../static/background_1.jpg");
    background-repeat: no-repeat; // no-repeat;
    background-size: cover;//contain;//cover;
    background-attachment: fixed;
    // min-height: 100vh;
    // height: 100vh;
    // height: unset;

    justify-content: flex-start;
}
.title {
    width: 90%;
    text-align: center;
    
    h1 {
        margin: 0;
    }
    .line {
        margin-bottom: 1em;
    }
}

button.active {
    background: violet;
}
.tabs-content {
    padding-left: 15px;
    padding-right: 20px;
    // min-height: 100vh;

    .flex-row div {
        margin-left: 20px;
    }

    h4 {
        margin-bottom: 10px;
    }
}
.god-portrait {
    max-width: 300px;
    border-radius: 10px;
}

.ability {
    align-items: center;
    img {
        height: fit-content;
    }
    p {
        margin-left: 10px;
        margin-top: 0px;
        margin-bottom: 0px;
    }
}

footer {
    height: 30px;
}
</style>